Tekla.Structures.Datatype.Distance.ToString
Creates a string representation of the distance.
Returns: The string representation of the distance.
This example shows how to convert a Tekla.Structures.Datatype.Distance instance to a string.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// For this demonstration, we'll format 300.2 millimeters.
Distance distance = new Distance(300.2);
// The default format uses the current unit type, current culture info and default number format.
string formattedString = distance.ToString();
}
}

Tekla.Structures.Datatype.Distance.useUnitsInDecimalString
Indicates whether to use units in desimal string representation.